config/Documents/ИнкассацияДенегОтКурьеров_ИнтернетАптека.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ИнкассацияДенегОтКурьеров_ИнтернетАптека</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УчетДенегВИнтернетАптеке</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курьер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Курьеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заказы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказОтПокупателя</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ИнтернетЗаказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отказ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвратНеВДеньПокупки</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Доставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипИсточника</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_ТипИсточникаЗаказа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЗаказа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗаказа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

config/AccumulationRegisters/УчетДенегВИнтернетАптеке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>УчетДенегВИнтернетАптеке</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Курьер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Курьеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказОтПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

config/Enums/ИА_СтатусЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ИА_СтатусЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зарегистрирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собран</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеКомплект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НекомплектЗаказан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Самовывоз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказНетПредоплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/Documents/ИнкассацияДенегОтКурьеров_ИнтернетАптека/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Сумма=Заказы.Итог("СуммаФакт");
	
	//---------------<ПРоверка отказов>---------------------------// GtG // 27.08.2012 14:59:34
	ЕстьОшибки=ЛОжь;
	Для Каждого стр из Заказы Цикл
		Если Стр.НомерЗаказа=0 Тогда
			Стр.ТипИсточника=Стр.ЗаказОтПокупателя.ТипИсточника;
			Стр.НомерЗаказа=Стр.ЗаказОтПокупателя.НомерЗаказа;
			Стр.ДатаЗаказа=Стр.ЗаказОтПокупателя.ДатаЗаказа;
		КонецЕсли;
		
		
		
		Если Стр.Сумма<>Стр.СуммаФакт тогда
			Если Стр.ВозвратНеВДеньПокупки.Пустая()=Истина ТОгда
				Сообщить("Не введен возврат по заказу "+Стр.ЗаказОтПокупателя);
				ЕстьОшибки=Истина;
			КонецЕсли;
			Если  Стр.ВозвратНеВДеньПокупки.Пустая()=Ложь Тогда
				Стр.Отказ=Истина;
			КонецЕсли;	
			
			
			
		Иначе
			//???
			
		КонецЕсли;
		
		
	КонецЦикла;	
	
	Если ЕстьОшибки=Истина Тогда
	   ПРедупреждение("Перед записью документа нужно создать возвраты по отказам!");
	   Отказ=Истина;
	КонецЕсли;   
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.УчетДенегВИнтернетАптеке.Очистить();
	Для Каждого Стр Из Заказы Цикл
		
		ДокЗаказ=Стр.ЗаказОтПокупателя.ПолучитьОбъект();
		ДокЗаказ.СтатусЗаказа=Перечисления.ИА_СтатусЗаказа.Оплачен;
		ДокЗаказ.Записать(РежимЗаписиДокумента.Запись);
		
		
		Движение=Движения.УчетДенегВИнтернетАптеке.Добавить();
		Движение.Активность=Истина;
		Движение.ВидДвижения=ВидДвиженияНакопления.Расход;
		Движение.ЗаказОтПокупателя=Стр.ЗаказОтПокупателя;
		Движение.Курьер=Курьер;
		Движение.Период=Дата;
		Движение.Регистратор=ЭтотОбъект.Ссылка;
		Движение.Склад=Склад;
		Движение.Сумма=Стр.СуммаФакт;
		Движение.Фирма=Фирма;
	КонецЦикла;	
	
	Движения.УчетДенегВИнтернетАптеке.Записать();
	
	
	
	
	
	
	
	
КонецПроцедуры
